{
  "backend/main.mo": "Main actor defining parcel, trip, rating, and user profile types with storage maps, access control, and sign‑up/profile management logic.",
  "backend/migration.mo": "Migration module converting old user profiles to include new phone number and government ID address fields while preserving other actor state.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test references for recent UI and interaction updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend React components and pages.",
  "frontend/index.css": "Tailwind base style definitions with custom CSS variables for light and dark themes.",
  "frontend/index.html": "Root HTML file bootstrapping the Parcel Wala frontend and loading the main React entry point.",
  "frontend/src/App.tsx": "Top-level app component managing authentication, profile setup flow, tab routing, and layout rendering.",
  "frontend/src/components/BrandHeader.tsx": "Header component showing brand logo and optional back button using navigation context.",
  "frontend/src/components/browse/InsuranceFilter.tsx": "Checkbox filter toggling whether only insured listings are shown.",
  "frontend/src/components/browse/RouteSearchBar.tsx": "Search bar for entering from/to cities with swap and quick‑select popular routes.",
  "frontend/src/components/browse/TravelModeFilter.tsx": "Dropdown for selecting travel mode or all modes using predefined Mode values.",
  "frontend/src/components/browse/VerifiedOnlyFilter.tsx": "Checkbox filter restricting results to verified users only.",
  "frontend/src/components/cards/ParcelCard.tsx": "Displays parcel info such as category, route, date, price, and insurance based on deserialized data.",
  "frontend/src/components/cards/TripCard.tsx": "Renders trip info with travel mode, verification, pricing, route, and details specific to train, flight, or bus trips.",
  "frontend/src/components/chat/ChatThread.tsx": "Chat thread view showing messages for a thread and allowing the user to send new messages.",
  "frontend/src/components/chat/ConversationList.tsx": "List of conversations with last message preview and unread counts, enabling thread selection.",
  "frontend/src/components/insurance/InsuranceSelect.tsx": "A dropdown component for selecting insurance tier, showing pricing and benefits based on travel mode.",
  "frontend/src/components/loading/SkeletonCard.tsx": "Displays a pulsing skeleton card placeholder for loading states.",
  "frontend/src/components/LoginButton.tsx": "Renders a login button using Internet Identity and shows loading or hides itself when already authenticated if loginOnly is true.",
  "frontend/src/components/MobileTabs.tsx": "Mobile bottom navigation bar with tab icons, highlighting active tab and showing unread badges for chat and notifications.",
  "frontend/src/components/motion/AnimatedSwap.tsx": "Handles fade transitions when content changes based on a swap key.",
  "frontend/src/components/motion/AnimatedTabContent.tsx": "Animates tab content sliding transitions with reduced-motion support.",
  "frontend/src/components/pricing/PriceCalculatorCard.tsx": "UI card for configuring shipment parameters and calculating price, with apply callback.",
  "frontend/src/components/profile/verification/EmailOtpVerificationSheet.tsx": "Bottom sheet flow for email OTP verification with email entry, OTP input, resend, and validation actions.",
  "frontend/src/components/profile/verification/GovernmentIdVerificationFlow.tsx": "Multi-step sheet for uploading, reviewing, and confirming government ID verification with upload progress.",
  "frontend/src/components/profile/verification/PhoneOtpVerificationSheet.tsx": "Bottom-sheet UI for entering a phone number, receiving an OTP, and verifying it using the actor API.",
  "frontend/src/components/profile/VerificationDashboard.tsx": "Dashboard listing verification steps with buttons to trigger phone, email, and ID verification flows.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and saves a basic profile, showing success/error toasts.",
  "frontend/src/components/SignUpModal.tsx": "Sign‑up modal collecting name, phone, and address, submitting via mutation and handling duplicate‑account errors.",
  "frontend/src/components/tracking/TrackActions.tsx": "Renders action buttons for map navigation, route viewing, and sharing a live tracking link.",
  "frontend/src/components/tracking/TrackedItemPicker.tsx": "Simple picker component allowing the user to select a predefined delivery item to track.",
  "frontend/src/components/tracking/TrackingTimeline.tsx": "Displays a vertical timeline of tracking events with status, location, timestamps, and coordinates.",
  "frontend/src/components/trips/TravelModeBadge.tsx": "Shows a colored badge with an icon and label representing the selected travel mode.",
  "frontend/src/components/trips/TravelModeSelect.tsx": "Select dropdown for choosing a travel mode, emitting the chosen Mode value.",
  "frontend/src/components/trips/TripModeDetailsForm.tsx": "Conditionally renders detailed form fields for car, bus, train, or flight travel info based on selected mode.",
  "frontend/src/components/trips/VerificationBadges.tsx": "Shows verification badges (vehicle, ticket, PNR, flight) depending on trip detail verification flags.",
  "frontend/src/contexts/NavigationContext.tsx": "Provides navigation history, back handling, and transient back handler support across the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useChat.ts": "LocalStorage‑based chat hook storing conversations, messages, and enabling message sending.",
  "frontend/src/hooks/useEarnings.ts": "Manages earnings transactions and withdrawals using LocalStorage, exposing totals and balances.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication, loading stored identities and handling login state.",
  "frontend/src/hooks/useNotifications.ts": "Manages notification list in localStorage with helpers to mark single or all notifications as read.",
  "frontend/src/hooks/useProfilePhoto.ts": "Handles loading, updating, and clearing a user profile photo using localStorage and object URLs.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, parcels, trips, and related mutations using an ICP actor.",
  "frontend/src/hooks/useTabScrollRestoration.ts": "Stores and restores scroll positions for each tab using refs and callbacks.",
  "frontend/src/hooks/useTracking.ts": "Simulates parcel tracking data with periodic GPS updates and persists a selected item in localStorage.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark themes, custom color variables, and motion-reduction utilities.",
  "frontend/src/layouts/MobileAppLayout.tsx": "Mobile layout with tab navigation, scroll restoration, animated transitions, and background styling.",
  "frontend/src/lib/domain/insurance.ts": "Defines insurance tiers and returns coverage details based on selected tier and transport mode.",
  "frontend/src/lib/domain/search.ts": "Provides various filtering utilities for parcels and trips based on route, price, insurance, verification, and travel mode.",
  "frontend/src/lib/domain/serialization.ts": "Defines parcel and trip data formats and provides JSON serialize/deserialize helpers.",
  "frontend/src/lib/pricing/priceCalculator.ts": "Computes parcel delivery price using distance, weight, mode, urgency, size, and other multipliers.",
  "frontend/src/lib/share/shareTracking.ts": "Shares a parcel tracking link using the Web Share API or falls back to copying the URL to the clipboard.",
  "frontend/src/lib/tracking/navigationLinks.ts": "Opens Google/Apple Maps for location search, routing, or navigation from the user’s current location.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Renders a login/signup prompt for users without access using Internet Identity authentication.",
  "frontend/src/pages/BrowsePage.tsx": "Displays parcel and trip listings with search filters for route, price, insurance, verification, and travel mode.",
  "frontend/src/pages/ChatPage.tsx": "Shows a list of conversations or an active chat thread depending on user selection.",
  "frontend/src/pages/EarningsPage.tsx": "Shows total earnings, balance, and recent transactions with a withdrawal action.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard with navigation shortcuts and summary of active parcels and trips.",
  "frontend/src/pages/MyListingsPage.tsx": "Displays the user's parcels and trips, filtering by principal and allowing deletion with confirmation.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows a list of notifications with read/unread state and actions to mark items as read.",
  "frontend/src/pages/OfferTripPage.tsx": "Form for creating a trip with mode-specific details, validation, and submission to the backend.",
  "frontend/src/pages/ProfilePage.tsx": "Renders user profile info with photo upload, verification indicators, and logout handling.",
  "frontend/src/pages/SendParcelPage.tsx": "Form for posting a parcel with basic details, validation, and submission using default travel mode.",
  "frontend/src/pages/TrackPage.tsx": "Shows tracking details for a selected item with progress, location, route, actions, and history timeline.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash-based), persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, radii, shadows, and animations with plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including UI direction, architecture notes, known issues, required image edits, and feature list."
}